ale87jan/LPC4088-Documentacion/Librerias/glcd.c
/**
 * @file    glcd.c
 * @brief   Funciones de manejo del LCD de 4.3" desde la tarjeta Embedded Artist Developer's Kit.
 *
 * @author      Alejandro Lara Doña - alejandro.lara@uca.es | Eduardo Romero
 * @date        2014/2025
 * @version     2.0
 *
 * @copyright   GNU General Public License version 3 or later
 */

#include "glcd.h"
#include <LPC407x_8x_177x_8x.h>
#include <stdio.h>
#include <string.h>
#include <stdarg.h>
#include "tipos.h"
#include "error.h"
#include "timer_lpc40xx.h"
#include "sdram.h"
#include "fuente.h"

// Variables de las fuentes definidas en los ficheros correspondientes fuente_#
extern fuente_t fuente_8x16;
extern fuente_t fuente_12x24;
extern fuente_t fuente_16x32;

// ===== GLCD - Constantes Privadas =====
/**
 * @brief   Tabla para obtener un puntero a la fuente a partir de un número de fuente.
 * @ingroup GLCD
 * @private
 */
static fuente_t *tabla_fuentes[NUMERO_FUENTES] ={&fuente_8x16, &fuente_12x24, &fuente_16x32};

/**
 * @brief   Estructura para almacenar la configuración actual de la LCD (color, fuente y posición)
 * para la salida de texto mediante glcd_printf.
 * @ingroup GLCD
 * @private
 */
static glcd_config_texto_t texto_actual = {
  .color = BLANCO,
  .color_fondo = NEGRO,
  .fuente = FUENTE16X32,
  .pos_x = 0,
  .pos_y = 0,
  .desplazamiento_activado = TRUE};


/**
 * @name  No Semihosting
 * @brief Reimplementación de funciones que utilizan semihosting.
 * @{
 */
FILE __stdout;
FILE __stdin;
FILE __stderr;
//!@}

/**
 * @brief   Inicializa la interfaz I2C0 como maestro.
 * @ingroup GLCD
 * @private
 *
 * @details   Se utilizan los pines P0[27] como SDA y P0[28] como SCL.
 */
static void glcd_i2c0_inicializar(void) {

  // Aplicar alimentación al módulo I2C0
  LPC_SC->PCONP |= (1u << 7);

  // Funcion I2C0_SDA con IOCON_NO_PULL_UP_NO_PULL_DOWN | IOCON_FILTER | IOCON_OD
  LPC_IOCON->P0_27 = 1 | (1<<10) | (1<<8);

  // Funcion I2C0_SCL con IOCON_NO_PULL_UP_NO_PULL_DOWN | IOCON_FILTER | IOCON_OD
  LPC_IOCON->P0_28 = 1 | (1<<10) | (1<<8);

  // Limpiar los flags
  LPC_I2C0->CONCLR = (1u << 6) | (1u << 5) | (1u << 3) | (1u << 2);

  // Configurar la frecuencia del reloj SCL
  LPC_I2C0->SCLL = 300;
  LPC_I2C0->SCLH = 300;

  // Habilita la interfaz
  LPC_I2C0->CONSET = 1u << 6;
}

/**
 * @brief   Genera una condición de START en el bus I2C.
 * @ingroup GLCD
 * @private
 *
 * @retval  Valor del registro I2C0->STAT.
 * @retval  -1 si se supera el timeout especificado.
 */
static int8_t glcd_i2c0_start(void) {

  uint32_t contador = 0;

  // Generar la condición de START
  LPC_I2C0->CONSET = 1u << 5;

  // Esperar hasta que se transmita el START o expire el I2C0_TIMEOUT
  while ((LPC_I2C0->CONSET & (1u << 3)) == 0) {
    contador++;
    if (contador > 0x01000000) {
      return -1;
    }
  }

  LPC_I2C0->CONCLR = 1u << 5;
  return LPC_I2C0->STAT;
}

/**
 * @brief   Genera una condición de STOP en el bus I2C.
 * @ingroup GLCD
 * @private
 */
static void glcd_i2c0_stop(void) {

  LPC_I2C0->CONCLR = 1u << 3;
  LPC_I2C0->CONSET = 1u << 4;

  // Esperar hasta que se transmita el STOP
  while (LPC_I2C0->CONSET & (1u << 4)) {;}
}

/**
 * @brief   Transmite un byte a un esclavo a través de la interfaz I2C0.
 * @ingroup GLCD
 * @private
 *
 * @param[in]   dato  Byte a transmitir.
 *
 * @return      Valor del registro I2C0->STAT.
 *
 */
static int8_t glcd_i2c0_transmitir_byte(uint8_t dato) {

  LPC_I2C0->CONCLR = 1u << 3;
  LPC_I2C0->DAT = dato;

  while ((LPC_I2C0->CONSET & (1u << 3)) == 0) {;}

  return LPC_I2C0->STAT;
}

/**
 * @brief   Transmite un array de bytes a través del I2C0.
 * @ingroup GLCD
 * @private
 *
 * @param[in] dir_i2c   Dirección del dispositivo I2C al que transmitir los datos.
 * @param[in] buf       Ptr. al array de bytes que se enviarán.
 * @param[in] len       Longitud del array.
 */
static void glcd_i2c0_transmitir_buffer(uint8_t dir_i2c, const uint8_t *buf, uint32_t len) {

  uint32_t i;

  glcd_i2c0_start();
  glcd_i2c0_transmitir_byte(dir_i2c << 1);

  for (i = 0; i < len; i++) {
    glcd_i2c0_transmitir_byte(*buf);
    buf++;
  }

  glcd_i2c0_stop();
}


/**
 * @brief   Inicializa el controlador LCD.
 * @ingroup GLCD
 */
void glcd_inicializar(void) {

  uint32_t i, divisor_reloj;
  uint8_t buffer[5];
  bool_t sdram = FALSE;

  // Inicializa la interfaz I2C0 que se utilizará para comunicarse con el controlador del panel LCD
  glcd_i2c0_inicializar();

  /* Inicializar el controlador de SDRAM. El framebuffer se mantiene en la SDRAM conectada al
   * LPC4088 en la tarjeta de desarrollo.
   */
  sdram = sdram_inicializar();

  // Configurar la función de los pines del LPC4088 que se usan para controlar la pantalla LCD

  // LPC_IOCON->P0_4 |= 7;   // P0[4] --> LCD_VD_0
  // LPC_IOCON->P0_5 |= 7;   // P0[5] --> LCD_VD_1
  // LPC_IOCON->P0_6 |= 7;   // P0[6] --> LCD_VD_8
  // LPC_IOCON->P0_7 |= 7;   // P0[7] --> LCD_VD_9
  // LPC_IOCON->P0_8 |= 7;   // P0[8] --> LCD_VD_16
  // LPC_IOCON->P0_9 |= 7;   // P0[9] --> LCD_VD_17

  LPC_IOCON->P2_12 |= 5;  // P2[12] --> LCD_VD_3
  LPC_IOCON->P2_6 |= 7;   // P2[6]  --> LCD_VD_4
  LPC_IOCON->P0_10 |= 7;  // P0[10] --> LCD_VD_5
  LPC_IOCON->P2_8 |= 7;   // P2[8]  --> LCD_VD_6
  LPC_IOCON->P2_9 |= 7;   // P2[9]  --> LCD_VD_7

  LPC_IOCON->P1_20 |= 7;  // P1[20] --> LCD_VD_10
  LPC_IOCON->P1_21 |= 7;  // P1[21] --> LCD_VD_11
  LPC_IOCON->P1_22 |= 7;  // P1[22] --> LCD_VD_12
  LPC_IOCON->P1_23 |= 7;  // P1[23] --> LCD_VD_13
  LPC_IOCON->P1_24 |= 7;  // P1[24] --> LCD_VD_14
  LPC_IOCON->P1_25 |= 7;  // P1[25] --> LCD_VD_15

  LPC_IOCON->P2_13 |= 7;  // P2[13] --> LCD_VD_19
  LPC_IOCON->P1_26 |= 7;  // P1[26] --> LCD_VD_20
  LPC_IOCON->P1_27 |= 7;  // P1[27] --> LCD_VD_21
  LPC_IOCON->P1_28 |= 7;  // P1[28] --> LCD_VD_22
  LPC_IOCON->P1_29 |= 7;  // P1[29] --> LCD_VD_23

  LPC_IOCON->P2_0 |= 7;   // P2[0]  --> LCD_PWR
  LPC_IOCON->P2_1 |= 7;   // P2[1]  --> LCD_LE
  LPC_IOCON->P2_2 |= 7;   // P2[2]  --> LCD_DCLK
  LPC_IOCON->P2_3 |= 7;   // P2[3]  --> LCD_FP
  LPC_IOCON->P2_4 |= 7;   // P2[4]  --> LCD_ENAB_M
  LPC_IOCON->P2_5 |= 7;   // P2[5]  --> LCD_LP
  LPC_IOCON->P2_11 |= 7;  // P2[11] --> LCD_CLKIN

  // Reiniciar funciones de los pines del joystick a GPIO en vez de la External RAM
  LPC_IOCON->P2_22 = 0;
  LPC_IOCON->P2_23 = 0;
  LPC_IOCON->P2_25 = 0;
  LPC_IOCON->P2_26 = 0;
  LPC_IOCON->P2_27 = 0;

  buffer[0] = GLCD_PCA9532_LS0 | GLCD_PCA9532_AUTO_INC;
  buffer[1] = 0;
  buffer[2] = GLCD_PCACTRL_DISP_EN;
  buffer[3] = 0;
  buffer[4] = 0;
  glcd_i2c0_transmitir_buffer(GLCD_PCA9532_I2C_ADDR, buffer, 5);

  buffer[0] = GLCD_PCA9532_PWM0;
  buffer[1] = 255;
  glcd_i2c0_transmitir_buffer(GLCD_PCA9532_I2C_ADDR, buffer, 2);

  buffer[0] = GLCD_PCA9532_PSC0;
  buffer[1] = 0;
  glcd_i2c0_transmitir_buffer(GLCD_PCA9532_I2C_ADDR, buffer, 2);

  buffer[0] = GLCD_PCA9532_LS0 | GLCD_PCA9532_AUTO_INC;
  buffer[1] = 0;
  buffer[2] = GLCD_PCACTRL_DISP_EN;
  buffer[3] = GLCD_LS_MODO_PWM0;
  buffer[4] = 0;
  glcd_i2c0_transmitir_buffer(GLCD_PCA9532_I2C_ADDR, buffer, 5);

  buffer[0] = GLCD_PCA9532_LS0 | GLCD_PCA9532_AUTO_INC;
  buffer[1] = 0;
  buffer[2] = GLCD_PCACTRL_DISP_EN;
  buffer[3] = GLCD_LS_MODO_PWM0;
  buffer[4] = 0;
  glcd_i2c0_transmitir_buffer(GLCD_PCA9532_I2C_ADDR, buffer, 5);

  timer_retardo_us(TIMER0, 100000);

  buffer[0] = GLCD_PCA9532_LS0 | GLCD_PCA9532_AUTO_INC;
  buffer[1] = GLCD_PCACTRL_3V3;
  buffer[2] = GLCD_PCACTRL_DISP_EN;
  buffer[3] = GLCD_LS_MODO_PWM0;
  buffer[4] = 0;
  glcd_i2c0_transmitir_buffer(GLCD_PCA9532_I2C_ADDR, buffer, 5);

  timer_retardo_us(TIMER0, 100000);

  buffer[0] = GLCD_PCA9532_LS0 | GLCD_PCA9532_AUTO_INC;
  buffer[1] = GLCD_PCACTRL_3V3;
  buffer[2] = 0;
  buffer[3] = GLCD_LS_MODO_PWM0;
  buffer[4] = 0;
  glcd_i2c0_transmitir_buffer(GLCD_PCA9532_I2C_ADDR, buffer, 5);

  timer_retardo_us(TIMER0, 100000);

