ale87jan/LPC4088-Documentacion/Librerias/glcd.c
  // Activar la alimentación del periférico LCD del LPC40XX
  LPC_SC->PCONP |= 1u;

  LPC_LCD->CTRL &= ~GLCD_CTRL_EN_BIT;  // Deshabilita la LCD

  LPC_LCD->TIMH = (((GLCD_PIXELES_POR_LINEA >> 4) - 1) << 2) |
                  ((GLCD_HSYNC_PULSE_WIDTH - 1) << 8) |
                  ((GLCD_HSYNC_FRONT_PORCH - 1) << 16) |
                  ((GLCD_HSYNC_BACK_PORCH - 1) << 24);

  LPC_LCD->TIMV = (GLCD_LINEAS_POR_PANEL - 1) | ((GLCD_VSYNC_PULSE_WIDTH - 1 )<< 10) |
                  (GLCD_VSYNC_FRONT_PORCH << 16) | (GLCD_VSYNC_BACK_PORCH << 24);

  // Calcular el divisor de reloj más cercano para conseguir la frecuencia deseada
  divisor_reloj = SystemCoreClock / GLCD_RELOJ_LCD;
  if (divisor_reloj >= 0x3F) {
    divisor_reloj = 0x3F;
  }

  if (divisor_reloj <= 1) {
    // Si el divisor sale inferior a 1, ignorar el divisor del reloj (GLCD_POL_BCD_BIT)
    LPC_LCD->POL = GLCD_POL_IVS_BIT | GLCD_POL_IHS_BIT | GLCD_POL_BCD_BIT |
                   ((GLCD_PIXELES_POR_LINEA - 1) << GLCD_POL_CPL);
  } else {
    divisor_reloj -= 2;
    LPC_LCD->POL = (divisor_reloj & 0x1F) | GLCD_POL_IVS_BIT | GLCD_POL_IHS_BIT |
                   ((GLCD_PIXELES_POR_LINEA - 1) << GLCD_POL_CPL) |
                   (((divisor_reloj >> 5) & 0x1F) << GLCD_POL_PCD_HI);  // 0x01DF180C
  }

  LPC_LCD->LE = 0x00000000;
  LPC_LCD->INTMSK = 0x00000000;

  LPC_LCD->CTRL = (GLCD_BPP_16 << GLCD_CTRL_BPP) | GLCD_CTRL_TFT_BIT | GLCD_CTRL_BGR_BIT;

  for (i = 0; i < 256; i++) {
    LPC_LCD->PAL[i] = 0;
  }
  LPC_SC->LCD_CFG = 0;

  LPC_LCD->CTRL |= GLCD_CTRL_EN_BIT;
  LPC_LCD->CTRL |= GLCD_CTRL_PWR_BIT;

  if (sdram) {
    LPC_LCD->UPBASE = GLCD_VRAM_BASE_ADDR & ~7UL;
    LPC_LCD->LPBASE = GLCD_VRAM_BASE_ADDR & ~7UL;

  } else {
    LPC_LCD->UPBASE = 0x10000000 & ~7UL;
    LPC_LCD->LPBASE = 0x10000000 & ~7UL;
  }

  glcd_borrar(0);

  buffer[0] = GLCD_PCA9532_PWM0;
  buffer[1] = 0;
  glcd_i2c0_transmitir_buffer(GLCD_PCA9532_I2C_ADDR, buffer, 2);

  buffer[0] = GLCD_PCA9532_PSC0;
  buffer[1] = 0;
  glcd_i2c0_transmitir_buffer(GLCD_PCA9532_I2C_ADDR, buffer, 2);

  buffer[0] = GLCD_PCA9532_LS0 | GLCD_PCA9532_AUTO_INC;
  buffer[1] = GLCD_PCACTRL_3V3;
  buffer[2] = 0;
  buffer[3] = 0;
  buffer[4] = 0;
  glcd_i2c0_transmitir_buffer(GLCD_PCA9532_I2C_ADDR, buffer, 5);
}

/**
 * @brief   Borra la pantalla LCD rellenándola con el color indicado.
 * @ingroup GLCD
 *
 * @param[in]   color   color con el que rellenar la pantalla LCD.
 */
void glcd_borrar(uint16_t color) {

  uint32_t i;
  volatile uint16_t *ptr = (uint16_t *) GLCD_VRAM_BASE_ADDR;

  for (i = 0; i < GLCD_TAMANO_X * GLCD_TAMANO_Y; i++) {
    *ptr++ = color;
  }
}

/**
 * @brief   Función análoga a printf para imprimir texto en la pantalla LCD.
 * @ingroup GLCD
 *
 * @param[in]   format  Cadena de caracteres a imprimir incluyendo opcionalmente especificadores
 *                      de formato que serán reemplazados por los valores de los argumentos
 *                      adicionales subsiguientes y formateados como se indique.
 * @param[in]   ...     Argumentos adicionales. Dependiendo de los especificadores de formato
 *                      incluidos en la cadena de formato, la función espera una secuencia de
 *                      argumentos adicionales cuyos valores se usan para reemplazar dichos
 *                      especificadores. Debe haber, al menos, tantos argumentos adicionales
 *                      como especificadores de formato. Los argumentos extra a los necesarios
 *                      son ignorados.
 *
 * @return      Si la función tiene éxito, retorna el número de caracteres que ha impreso. En
 *              caso de error, se retorna un número negativo.
 */
int32_t glcd_printf(const char *format, ...) {

  int32_t retval;

  va_list args;
  va_start(args, format);
  retval = vprintf(format, args);
  va_end(args);

  return retval;
}

/**
 * @brief   Función de salida de caracteres que es llamada internamente desde la familia de
 * funciones printf y por tanto por glcd_printf (que usa vprintf). Reconoce los caracteres de
 * control '\\b', '\\f', '\\n', '\\r', '\\t' y '\\v'.
 * @ingroup GLCD
 * @internal
 *
 * @param[in]   c       Carácter a imprimir.
 * @param[in]   stream  Puntero a estructura FILE que indentifica al stream al que enviar la
 *                      salida. Sólo se reconoce stdout.
 *
 * @return      Si el fichero de salida indicado es stdout, retorna c. En caso contrario,
 *              retorna EOF.
 */
int32_t fputc(int32_t c, FILE *stream) {

  const fuente_t *fuente_ptr = tabla_fuentes[texto_actual.fuente];

  if (stream == stdout) {
    int16_t incremento_x = 0;
    uint16_t incremento_y = 0;
    switch (c) {
      case '\b':  // Backspace
        incremento_x = - fuente_ptr->pixeles_ancho;
        break;
      case '\f':  // Form feed
        texto_actual.pos_x = 0;
        incremento_y = GLCD_TAMANO_Y;
        break;
      case '\n':  // Line feed
        texto_actual.pos_x = 0;
        incremento_y = fuente_ptr->pixeles_alto;
        break;
      case '\r':  // Carriage return
        texto_actual.pos_x = 0;
        break;
      case '\t':  // Horizontal tab
        texto_actual.pos_x = ((texto_actual.pos_x / (8 * fuente_ptr->pixeles_ancho)) + 1) * 8 *
                         fuente_ptr->pixeles_ancho;
        break;
      case '\v':  // Vertical tab
        incremento_y = fuente_ptr->pixeles_alto;
        break;
      default:
        break;
    }

    if (texto_actual.pos_x < incremento_x) {
      texto_actual.pos_x = 0;
    } else if ((texto_actual.pos_x + incremento_x) > GLCD_X_MAXIMO) {
      texto_actual.pos_x = 0;
      if (incremento_y < fuente_ptr->pixeles_alto) {
        incremento_y = fuente_ptr->pixeles_alto;
      }
    } else {
      texto_actual.pos_x += incremento_x;
    }

    texto_actual.pos_y += incremento_y;
    if ((texto_actual.pos_y + fuente_ptr->pixeles_alto - 1) > GLCD_Y_MAXIMO) {
      if (texto_actual.desplazamiento_activado) {
        if (incremento_y > GLCD_TAMANO_Y) {
          incremento_y = GLCD_TAMANO_Y;
          texto_actual.pos_y = 0;
        } else if (incremento_y < GLCD_TAMANO_Y) {
          if (texto_actual.pos_y < incremento_y) {
            texto_actual.pos_y = 0;
          } else {
            texto_actual.pos_y -= incremento_y;
          }
        } else {
          texto_actual.pos_y = 0;
        }
        glcd_desplazar(incremento_y);
      } else {
        texto_actual.pos_y = 0;
      }
    }

    if (c >= fuente_ptr->primer_caracter && c <= fuente_ptr->ultimo_caracter) {
      glcd_caracter(c, texto_actual.pos_x, texto_actual.pos_y, texto_actual.color,
                    texto_actual.color_fondo, texto_actual.fuente);

      texto_actual.pos_x += fuente_ptr->pixeles_ancho;
    }
    return c;
  }

  return EOF;
}

/**
 * @brief   Función de entrada de caracteres que es llamada internamente por la familia de scanf.
 * @ingroup GLCD
 * @internal
 *
 * @param[in]   file  Puntero a estructura FILE que indentifica al stream del que se quiere leer.
 *
 * @return      Siempre retorna EOF.
 *
 * @warning     Función no implementada.
 */
int32_t fgetc(__attribute__((unused)) FILE *file) {
  return EOF;
}

/**
 * @brief   Comprueba el estado del indicador de error de un stream.
 * @ingroup GLCD
 * @internal
 *
 * @param[in]   stream  Puntero a estructura FILE que indentifica al stream cuyo estado de error se
 *                      quiere comprobar.
 *
 * @return      Retorna un valor distinto de 0 si la operación anterior sobre el stream produjo un
 *              error y un valor igual a 0 en caso contrario. En esta implementación, si el stream
 *              es stdout siempre se retorna 0 y en caso contrario siempre se retorna un valor
 *              distinto de 0.
 */
int32_t ferror(FILE *stream) {
  if (stream == stdout) {
    return 0;
  }

  return 1;
}

/**
 * @brief   Al realizar el retarget de las funciones de la familia printf, el compilador del
 * Keil MDK precisa que se defina la función _sys_exit que corresponde a la llamada del sistema
 * `sys_exit` que termina el proceso actual. En esta implementación no se retorna al sistema (ya
 * que no hay) sino que se deja encerrado al programa en un bucle infinito.
 * @ingroup GLCD
 * @internal
 *
 * @param[in]   return_code   Código que debe retornarse al sistema.
 */
void _sys_exit(__attribute__((unused)) int32_t return_code) {

  uint32_t i;

  // Dejar al programa encerrado aquí
  LPC_GPIO1->DIR |= (1u << 5);

  while (1) {
    LPC_GPIO1->CLR = (1u << 5);
    for (i = 0; i < 5000000; i++) { __NOP(); }
    LPC_GPIO1->SET = (1u << 5);
    for (i = 0; i < 5000000; i++) { __NOP(); }
  }
}

/**
 * @brief   Fija el color que se usará para la salida de texto con glcd_printf.
 * @ingroup GLCD
 *
 * @param[in]   color   Color de texto que usará glcd_printf.
 */
void glcd_color_texto(uint16_t color) {
  texto_actual.color = color;
}

/**
 * @brief   Fija el color de fondo que se usará para la salida de texto con glcd_printf.
 * @ingroup GLCD
 *
 * @param[in]   color_fondo   Color de fondo que usará glcd_printf.
 */
void glcd_fondo_texto(uint16_t color_fondo) {
  texto_actual.color_fondo = color_fondo;
}

/**
 * @brief   Fija las coordenadas en las que se mostrará el texto en la siguiente llamada a
 * `glcd_printf`. Sólo tiene efecto si las coordenadas están dentro de la pantalla.
 * @ingroup GLCD
 *
 * @param[in]   x   Coordenada X de la pantalla.
 * @param[in]   y   Coordenada Y de la pantalla.
 */
void glcd_xy_texto(uint16_t x, uint16_t y) {

  if (x > GLCD_X_MAXIMO || y > GLCD_Y_MAXIMO) {
    return;
  }
  texto_actual.pos_x = x;
  texto_actual.pos_y = y;
}

/**
 * @brief   Desplaza hacia arriba el contenido de la pantalla un determinado número de líneas.
 * Las líneas inferiores se rellenan con el color del fondo de texto actual.
 * @ingroup GLCD
 *
 * @param[in]   lineas  Líneas a desplazar.
 */
void glcd_desplazar(uint16_t lineas) {

  uint32_t i;
  volatile uint16_t *ptr = (uint16_t *) GLCD_VRAM_BASE_ADDR;

  if (lineas > GLCD_TAMANO_Y) {
    lineas = GLCD_TAMANO_Y;
  }

  memmove((void *) ptr, (void *)(ptr + lineas * GLCD_TAMANO_X),
          GLCD_TAMANO_X * (GLCD_TAMANO_Y - lineas) * 2);

  ptr += GLCD_TAMANO_X * (GLCD_TAMANO_Y - lineas);
  for (i = 0; i < GLCD_TAMANO_X * lineas; i++) {
    *ptr++ = texto_actual.color_fondo;
  }
}

/**
 * @brief   Activa o desactiva el desplazamiento automático hacia arriba del contenido de la
 * pantalla cuando la salida de texto mediante glcd_printf sobrepasa la linea inferior.
 * @ingroup GLCD
 *
 * @param[in]   activar   TRUE => activar, FALSE => desactivar.
 */
void glcd_activar_desplazamiento(bool_t activar) {
  texto_actual.desplazamiento_activado = activar;
}

/**
 * @brief   Selecciona la fuente de caracteres que se usará para la salida de texto mediante
 * la función `glcd_printf`.
 * @ingroup GLCD
 *
 * @param[in]   fuente  Número de la fuente a seleccionar.
 */
void glcd_seleccionar_fuente(uint32_t fuente) {

  ASSERT(fuente < NUMERO_FUENTES, "Fuente incorrecta.");

  texto_actual.fuente = fuente;
}

/**
 * @brief   Función parecida a glcd_printf pero pudiendo indicar las coordedadas donde aparece
 * el texto, el color del texto y la fuente.
 * @ingroup GLCD
 *
 * @param[in]   x             Coordenada X de pantalla en la que se imprimirá.
 * @param[in]   y             Coordenada Y de pantalla en la que se imprimirá.
 * @param[in]   color         Color con el que se imprimirá el texto.
 * @param[in]   color_fondo   Color de fondo con el que se imprimirá el texto.
 * @param[in]   fuente        Fuente de caracteres con la que se imprimirá.
 * @param[in]   format        Cadena de caracteres a imprimir incluyendo opcionalmente
 *                            especificadores de formato que serán reemplazados por los valores de
 *                            los argumentos subsiguientes y formateados como se indique.
 * @param[in]   ...           Argumentos adicionales. Dependiendo de los especificadores de formato
 *                            incluidos en la cadena de formato, la función espera una secuencia de
 *                            argumentos adicionales cuyos valores se usan para reemplazar dichos
 *                            especificadores. Debe haber, al menos, tantos argumentos adicionales
 *                            como especificadores de formato. Los argumentos extra a los
 *                            necesarios se ignoran.
 *
 * @return      Si la función tiene éxito, retorna el número de caracteres que ha impreso. En caso
 *              de error, se retorna un número negativo.
 *
 * @note        No se actualiza la configuración actual de colores o posición de la LCD.
 */
int32_t glcd_xprintf(uint16_t x, uint16_t y, uint16_t color, uint16_t color_fondo, uint32_t fuente,
                     const char *format, ...) {

  uint16_t pos_x_anterior, pos_y_anterior, fuente_anterior, color_anterior, color_fondo_anterior;
  int32_t retval;
  va_list args;

  pos_x_anterior = texto_actual.pos_x;
  pos_y_anterior = texto_actual.pos_y;
  color_anterior = texto_actual.color;
  color_fondo_anterior = texto_actual.color_fondo;
  fuente_anterior = texto_actual.fuente;

  texto_actual.pos_x = x;
  texto_actual.pos_y = y;
  texto_actual.color = color;
  texto_actual.color_fondo = color_fondo;
  texto_actual.fuente = fuente;

  va_start(args, format);
  retval = vprintf(format, args);
  va_end(args);

