ale87jan/LPC4088-Documentacion/Librerias/glcd.c
  texto_actual.pos_x = pos_x_anterior;
  texto_actual.pos_y = pos_y_anterior;
  texto_actual.color = color_anterior;
  texto_actual.color_fondo = color_fondo_anterior;
  texto_actual.fuente = fuente_anterior;

  return retval;
}

/**
 * @brief   Imprime un carácter en pantalla. No se interpretan caracteres de control.
 * @ingroup GLCD
 *
 * @param[in]   c             Carácter a imprimir. Sólo se imprimirá si es uno de los caracteres
 *                            definidos en la fuente indicada por el argumento fuente y las
 *                            coordenadas indicadas por los argumentos `x` e `y` están dentro de
 *                            la pantalla. En caso contrario no se imprimirá nada.
 * @param[in]   x             Coordenada X de pantalla en la que se imprimirá.
 * @param[in]   y             Coordenada Y de pantalla en la que se imprimirá.
 * @param[in]   color         Color con el que se imprimirá el carácter.
 * @param[in]   color_fondo   Color de fondo con el que se imprimirá el carácter.
 * @param[in]   fuente        Fuente de caracteres con la que se imprimirá.
 */
void glcd_caracter(char c, uint16_t x, uint16_t y, uint16_t color, uint16_t color_fondo,
                   uint32_t fuente) {

  const fuente_t *fuente_ptr = tabla_fuentes[fuente];
  uint16_t pixeles_ancho, pixeles_alto, bytes_por_fila, salto_en_fb, i, j;
  const uint8_t *ptr_df;
  uint8_t b, mascara;
  volatile uint16_t *ptr_fb;

  ASSERT(fuente < NUMERO_FUENTES, "Fuente incorrecta.");

  if ( x > GLCD_X_MAXIMO || y > GLCD_Y_MAXIMO) {
    return;
  }

  if (c < fuente_ptr->primer_caracter || c > fuente_ptr->ultimo_caracter) {
    return;
  }

  pixeles_ancho = fuente_ptr->pixeles_ancho;
  pixeles_alto  = fuente_ptr->pixeles_alto;
  bytes_por_fila = pixeles_ancho >> 3;
  if ((pixeles_ancho & 7) != 0) bytes_por_fila++;

  ptr_df = fuente_ptr->datos + (c - fuente_ptr->primer_caracter) * bytes_por_fila * pixeles_alto;

  ptr_fb = (uint16_t *) GLCD_VRAM_BASE_ADDR + y * GLCD_TAMANO_X + x;
  salto_en_fb = GLCD_TAMANO_X - fuente_ptr->pixeles_ancho;

  for (i = 0; i < pixeles_alto; i++) {
    for (j = 0; j < pixeles_ancho; j++) {
      if ((j & 7) == 0) {
        b = *ptr_df++;
        mascara = 0x80;
      } else {
        mascara >>= 1;
      }

      if (b & mascara) {
        *ptr_fb++ = color;
      } else {
        *ptr_fb++ = color_fondo;
      }
    }
    ptr_fb += salto_en_fb;
  }
}

/**
 * @brief   Imprime una cadena de caracteres en la pantalla LCD. No se interpretan los caracteres
 * de control.
 * @ingroup GLCD
 *
 * @param[in]   x             Coordenada X de pantalla en la que se imprimirá.
 * @param[in]   y             Coordenada Y de pantalla en la que se imprimirá.
 * @param[in]   color         Color con el que se imprimirá el carácter.
 * @param[in]   color_fondo   Color de fondo con el que se imprimirá el carácter.
 * @param[in]   fuente        Fuente de caracteres con la que se imprimirá.
 * @param[in]   str           Puntero a la cadena a imprimir. Sólo se imprimirá si las coordenadas
 *                            indicadas por los argumentos `x` e `y` están dentro de la pantalla.
 *                            En caso contrario, no se imprimirá nada.
 */
void glcd_texto(uint16_t x, uint16_t y, uint16_t color, uint16_t color_fondo,
                uint32_t fuente, const char *str) {

  const fuente_t *fuente_ptr = tabla_fuentes[fuente];

  ASSERT(str != NULL, "El puntero a la cadena es nulo.");
  ASSERT(fuente < NUMERO_FUENTES, "Fuente incorrecta.");

  if (x > GLCD_X_MAXIMO || y > GLCD_Y_MAXIMO) {
    return;
  }

  while (*str != 0) {
    glcd_caracter(*str, x, y, color, color_fondo, fuente);

    x += fuente_ptr->pixeles_ancho;
    if (x > GLCD_X_MAXIMO) {
      x = 0;
      y += fuente_ptr->pixeles_alto;
      if (y > GLCD_Y_MAXIMO) {
        y = 0;
      }
    }
    str++;
  }
}

/**
 * @brief   Dibuja un punto (pixel) en la pantalla LCD.
 * @ingroup GLCD
 *
 * @param[in]   x       Coordenada X del punto.
 * @param[in]   y       Coordenada Y del punto.
 * @param[in]   color   Color del punto.
 */
void glcd_punto(uint16_t x, uint16_t y, uint16_t color) {

  volatile uint16_t *ptr = (uint16_t *) GLCD_VRAM_BASE_ADDR;

  if (x > GLCD_X_MAXIMO || y > GLCD_Y_MAXIMO) {
    return;
  }

  ptr[y * GLCD_TAMANO_X + x] = color;
}

/**
 * @brief   Dibuja en la pantlla LCD un segmento de línea recta definido por las coordenadas de
 * sus extremos. Si las coordenadas de uno o ambos extremos del segmento están fuera de la pantalla
 * se dibuja la porción contenida en la misma (si la hay).
 * @ingroup GLCD
 *
 * @param[in]   x0      Coordenada X del primer extremo del segmento.
 * @param[in]   y0      Coordenada Y del primer extremo del segmento.
 * @param[in]   x1      Coordenada X del segundo extremo del segmento.
 * @param[in]   y1      Coordenada Y del segundo extremo del segmento.
 * @param[in]   color   Color del segmento.
 */
void glcd_linea(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t color) {

  uint16_t x, y;
  int32_t dx, dy, p, incE, incNE, stepx, stepy;

  // Mejorar con algoritmo Fast clipping
  dx = x1 - x0;
  dy = y1 - y0;

  if (dy < 0) {
    dy = -dy;
    stepy = -1;
  } else {
    stepy = 1;
  }

  if (dx < 0) {
    dx = -dx;
    stepx = -1;
  } else {
    stepx = 1;
  }

  x = x0;
  y = y0;
  glcd_punto(x, y, color);

  if (dx > dy) {
    p = 2 * dy - dx;
    incE = 2 * dy;
    incNE = 2 * (dy - dx);
    while (x != x1) {
      x = x + stepx;
      if (p < 0) {
        p = p + incE;
      } else {
        y = y + stepy;
        p = p + incNE;
      }
      glcd_punto(x, y, color);
    }
  } else {
    p = 2 * dx - dy;
    incE = 2 * dx;
    incNE = 2 * (dx - dy);
    while (y != y1) {
      y = y + stepy;
      if (p < 0) {
        p = p + incE;
      } else {
        x = x + stepx;
        p = p + incNE;
      }
      glcd_punto(x, y, color);
    }
  }
}

/**
 * @brief   Dibuja en la pantalla LCD un rectángulo definido por las coordenadas de los vértices
 * de una diagonal. Se dibuja la porción del rectángulo contenida entre los límites de la pantalla.
 * @ingroup GLCD
 *
 * @param[in]   x0      Coordenada X de un vértice.
 * @param[in]   y0      Coordenada Y de un vértice.
 * @param[in]   x1      Coordenada X del vértice opuesto al dado por (x0, y0).
 * @param[in]   y1      Coordenada Y del vértice opuesto al dado por (x0, y0).
 * @param[in]   color   Color del rectángulo.
 */
void glcd_rectangulo(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t color) {

