ale87jan/LPC4088-Documentacion/Librerias/glcd.c
  glcd_linea(x0, y0, x1, y0, color);
  glcd_linea(x1, y0, x1, y1, color);
  glcd_linea(x1, y1, x0, y1, color);
  glcd_linea(x0, y1, x0, y0, color);
}

/**
 * @brief   Dibuja en la pantalla LCD un rectángulo relleno definido por las coordenadas de los
 * vértices de una diagonal. Se dibuja la porción del rectángulo contenida en los límites de la
 * pantalla.
 * @ingroup GLCD
 *
 * @param[in]   x0      Coordenada X de un vértice.
 * @param[in]   y0      Coordenada Y de un vértice.
 * @param[in]   x1      Coordenada X del vértice opuesto al dado por (x0, y0).
 * @param[in]   y1      Coordenada Y del vértice opuesto al dado por (x0, y0).
 * @param[in]   color   Color del rectángulo.
 */
void glcd_rectangulo_relleno(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t color) {

  uint16_t temp, i, j;
  uint16_t *ptr = (uint16_t *) GLCD_VRAM_BASE_ADDR;

  if (x0 > x1) {
    temp = x0;
    x0 = x1;
    x1 = temp;
  }

  if (y0 > y1) {
    temp = y0;
    y0 = y1;
    y1 = temp;
  }

  if (x1 > GLCD_X_MAXIMO) x1 = GLCD_X_MAXIMO;
  if (y1 > GLCD_Y_MAXIMO) y1 = GLCD_Y_MAXIMO;

  ptr +=  GLCD_TAMANO_X * y0 + x0;

  for (i = y0; i <= y1; i++) {
    uint16_t *ptr2 = ptr;
    ptr += GLCD_TAMANO_X;
    for (j = x0; j <= x1; j++) {
      *ptr2++ = color;
    }
  }
}

/**
 * @brief   Dibuja una circunferencia en la pantalla LCD. Se dibuja la parte de la circunferencia
 * contenida entre los límites de la pantalla.
 * @ingroup GLCD
 *
 * @param[in]   xc      Coordenada X del centro.
 * @param[in]   yc      Coordenada Y del centro.
 * @param[in]   radio   Radio de la circunferencia (en píxeles).
 * @param[in]   color   Color de la circunferencia.
 */
void glcd_circunferencia(uint16_t xc, uint16_t yc, uint16_t radio, uint16_t color) {

  uint16_t x = radio, y = 0;
  int32_t err = 0;

  while (x >= y) {
    glcd_punto(xc + x, yc + y, color);
    glcd_punto(xc + y, yc + x, color);
    glcd_punto(xc - y, yc + x, color);
    glcd_punto(xc - x, yc + y, color);
    glcd_punto(xc - x, yc - y, color);
    glcd_punto(xc - y, yc - x, color);
    glcd_punto(xc + y, yc - x, color);
    glcd_punto(xc + x, yc - y, color);

    if (err <= 0) {
      y += 1;
      err += 2 * y + 1;

    } else {
      x -= 1;
      err -= 2 * x + 1;
    }
  }
}

/**
 * @brief   Dibuja un circulo relleno en la pantalla LCD. Se dibuja la parte del cículo contenido
 * entre los límites de la pantalla.
 * @ingroup GLCD
 *
 * @param[in]   xc      Coordenada X del centro.
 * @param[in]   yc      Coordenada Y del centro.
 * @param[in]   radio   Radio del circulo (en píxeles).
 * @param[in]   color   Color del circulo.
 */
void glcd_circulo(uint16_t xc, uint16_t yc, uint16_t radio, uint16_t color) {

  uint16_t x = radio, y = 0;
  int32_t err = 0;

  while (x >= y) {
    glcd_linea(xc - x, yc - y, xc + x, yc - y, color);
    glcd_linea(xc - x, yc + y, xc + x, yc + y, color);
    glcd_linea(xc - y, yc - x, xc + y, yc - x, color);
    glcd_linea(xc - y, yc + x, xc + y, yc + x, color);

    if (err <= 0) {
      y += 1;
      err += 2 * y + 1;

    } else {
      x -= 1;
      err -= 2 * x + 1;
    }
  }
}
